Revit 2027 API
BuiltInFailures.RebarShapeFailures.CurvesUnlooped Property
 Segments defining the Rebar Shape must be in a continuous loop.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CurvesUnlooped { get; }
Public Shared ReadOnly Property CurvesUnlooped As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CurvesUnlooped {
	FailureDefinitionId^ get ();
}
static member CurvesUnlooped : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarShapeFailures Class
Autodesk.Revit.DB Namespace